<?php
 /** Файл схемы замен опечаток текста (только RU и EN)
 * @author [Eugene]
 * @copyright 2011
 * @url http://forwebm.net
 */
 if (!@defined('W_ENGINED_L')) exit('Can`t access to this file data!');
 //-------------------------------------------------------------------------------------
 $CHARS_LIST_MAP_MISTAKES = array(
  
  'words' => array(  
   //1-st
   'й' => array('ц','ы','ф','1','й','фй','2','цй'),
   'q' => array('w','s','a','1','q','aq','2','wq'),
  
   'ц' => array('й','2','ы','у','ыц'),
   'w' => array('q','2','s','e','sw'),
  
   'у' => array('ц','3','ы','к','у3','в'),
   'e' => array('w','3','s','r','e3','d'),
  
   'к' => array('е','у','в','а','к'),
   'r' => array('t','e','d','f','r'),
  
   'е' => array('к','пе','е','н'),
   't' => array('r','gt','t','y'),
  
   'н' => array('е','р','г','н','рн'),
   'y' => array('t','g','u','y','gy'),
  
   'г' => array('ш','г','н','рг','о'),
   'u' => array('i','u','h','gu','j'),
  
   'ш' => array('г','ш','щ','л','о','ш9','8'),
   'o' => array('u','i','o','k','j','i9','8'),
  
   'щ' => array('ш','щ','з','л','д','лщ'),
   'o' => array('i','o','p','k','l','ko'),
  
   'з' => array('х','ш','з','ж','зх','0','щ'),
   'p' => array('[','i','p',';','p[','0','o'),
  
   'х' => array('ъ','з','х','э','ж',"\n",'-'),
   'ъ' => array('\\',"\n",'х','ъ','э'),
  
   //2-st
   'ф' => array('й','я','ы','ыф','ф'),
   'a' => array('q','z','s','sa','a'),
  
   'ы' => array('ц','ы','в','ыц','ф','ч'),
   's' => array('w','s','d','sw','a','x'),
  
   'в' => array('у','ц','ы','с','а','ву','в'),
   'd' => array('e','w','s','c','f','de','d'),
  
   'а' => array('в','п','а','к','с','м','па'),
   'f' => array('d','g','f','r','c','v','gf'),
  
   'п' => array('р','п','а','е','пи','пе'),
   'g' => array('h','g','f','t','gb','gt'),
  
   'р' => array('п','о','р','ор','н','рр'),
   'h' => array('g','j','h','jh','y','hh'),
  
   'о' => array('л','о','р','ь','т','г','ро'),
   'j' => array('k','j','h','m','n','u','hj'),
  
   'л' => array('о','л','лд','лл','щ','ш','б'),
   'k' => array('j','k','kl','kk','o','i'),
  
   'д' => array('э','ж','л','д','щ','б','дд'),
   'l' => array(';','l','k','o','ll'),
  
   'ж' => array('э','жх','д','жэ','жж','ж','ю'),
   'э' => array("\n",'ж','х','жэ','ээ'),
  
   //3-st
   'я' => array('','ч','ы','ф','я','чя'),
   'z' => array('','x','s','a','z','xz'),
  
   'ч' => array(' ','с','я','ы','сч','ч','чч'),
   'x' => array(' ','c','z','s','cx','x','xx'),
  
   'с' => array(' ','с','сч','м','в','а','св'),
   'c' => array(' ','c','cx','v','d','f','cd'),
  
   'м' => array(' ','с','м','а','п','и','ма','мм',' м'),
   'v' => array(' ','c','v','f','g','b','vf','vv',' v'),
  
   'и' => array(' ','и','т','м','п','р','ит','ии','ми'),
   'b' => array(' ','b','n','v','g','h','bn','bv','vb'),
  
   'т' => array(' ','ь','и','р','то','т'),
   'n' => array(' ','m','b','h','nj','n'),
  
   'ь' => array('б',' ','ь','т','о','л','ьб'),
   'm' => array(' ','m','n','j','k','mk'),
  
   'б' => array('ь','б','ю',' ','бб','бд','ьб','л'),
   'ю' => array(' ','.','б','д','','юж','ю'),
   'ё' => array('1','','ё'),
  ),
  
  'keyboardrepl' => array(
   'й' => 'q', 
   'ц' => 'w', 
   'у' => 'e', 
   'к' => 'r', 
   'е' => 't', 
   'н' => 'y', 
   'г' => 'u', 
   'ш' => 'i', 
   'щ' => 'o', 
   'з' => 'p', 
   'х' => '[', 
   'ъ' => ']', 
   'ё' => '`', 
   'ф' => 'a', 
   'ы' => 's', 
   'в' => 'd', 
   'а' => 'f', 
   'п' => 'g', 
   'р' => 'h', 
   'о' => 'j', 
   'л' => 'k', 
   'д' => 'l', 
   'ж' => ';', 
   'э' => "'", 
   'я' => 'z', 
   'ч' => 'x', 
   'с' => 'c', 
   'м' => 'v', 
   'и' => 'b', 
   'т' => 'n', 
   'ь' => 'm', 
   'б' => ',', 
   'ю' => '.'  
  ),
/*
    ё 1 2 3 4 5 6 7 8 9 0 - =
       й ц у к е н г ш щ з х ъ \
       ф ы в а п р о л д ж э
       я ч с м и т ь б ю .
       
      1 2 3 4 5 6 7 8 9 0 - =
       q w e r t y u i o p [ ] \
       a s d f g h j k l ; '
       z x c v b n m , . /     
 */
 );
 //-------------------------------------------------------------------------------------
 /* Copyright (с) 2011 forwebm.net */
?>